CSI API ETABS v1
cPointElm.GetSpringCoupled Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpringCoupled(
	string Name,
	ref double[] K
)
Function GetSpringCoupled (
	Name As String,
	ByRef K As Double()
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim K As Double()
Dim returnValue As Integer
returnValue = instance.GetSpringCoupled(Name,
	K)
int GetSpringCoupled(
	String^ Name,
	array<double>^% K
)
abstract GetSpringCoupled :
        Name : string *
        K : float[] byref -> int
Parameters
Name
Type: System.String
K
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace